In [3]:
# open source library
# helpful in data manipulation and analysis

In [4]:
import pandas as pd
import numpy as np

### series -> one dimensional
### DataFrame -> multi dimensional

In [ ]:
# using pandas 1d

In [10]:
val=pd.Series([34,57,96,30])
val

0    34
1    57
2    96
3    30
dtype: int64

In [11]:
# using numpy 1d

In [12]:
val2=pd.Series(np.array([34,57,96,30]))
val2

0    34
1    57
2    96
3    30
dtype: int32

In [13]:
val3=pd.Series(val2)
val2

0    34
1    57
2    96
3    30
dtype: int32

In [32]:
val4=pd.Series([{0:20, 2:12, 4:43, 6:45, 8:65, 10:66}])
val4
print(val4[0][0])

20

In [21]:
val4=pd.Series([20,12,43,45,65],index=np.arange(2,12,2))
val4

2     20
4     12
6     43
8     45
10    65
dtype: int64

In [26]:
alp=["A1","A2","A3","A4","A5","A6"]
val5=pd.Series([20,12,43,45,65,66],index=alp)
val5

A1    20
A2    12
A3    43
A4    45
A5    65
A6    66
dtype: int64

In [27]:
val6=pd.Series([20,12,43,45,65,66],index=["A1","A2","A3","A4","A5","A6"])
val6

A1    20
A2    12
A3    43
A4    45
A5    65
A6    66
dtype: int64

In [30]:
val7=pd.Series([23000, 45000, 67000],index=["Dairy","Soft Drinks","Fruits and Vegetables"])
val7

Dairy                    23000
Soft Drinks              45000
Fruits and Vegetables    67000
dtype: int64

In [41]:
val8=pd.Series({'x':["Maths","Science","English"],'y':["Maths","Science"],'z':["Science"]})
print(val8)

[list(['Maths', 'Science', 'English']) list(['Maths', 'Science'])
 list(['Science'])]

In [ ]:
# returns all

In [44]:
print(val8.keys)

<bound method Series.keys of x    [Maths, Science, English]
y             [Maths, Science]
z                    [Science]
dtype: object>

In [ ]:
# retruns only index

In [45]:
print(val8.index)

Index(['x', 'y', 'z'], dtype='object')

In [47]:
# retruns only values

In [43]:
print(val8.values)

[list(['Maths', 'Science', 'English']) list(['Maths', 'Science'])
 list(['Science'])]

In [58]:
val8['x']

['Maths', 'Science', 'English']

In [56]:
val8[['x','y']]

x    [Maths, Science, English]
y             [Maths, Science]
dtype: object

In [ ]:
ds1=np.array(["A1","A2","A3","A4","A5","A6","A7","A8","A9"],index=np.arange(9))
ds

In [50]:
val8[:2]

x    [Maths, Science, English]
y             [Maths, Science]
dtype: object

In [51]:
val8.head(5)

x    [Maths, Science, English]
y             [Maths, Science]
z                    [Science]
dtype: object

In [52]:
val8.tail(5)

x    [Maths, Science, English]
y             [Maths, Science]
z                    [Science]
dtype: object

In [ ]:
val8[5:]

In [59]:
val8[-5:]

x    [Maths, Science, English]
y             [Maths, Science]
z                    [Science]
dtype: object

In [63]:
val9={"sophia":450,"Mia":303,"Philip":432,"Emma":150,"Lily":293,"Grace":112}
val10=pd.Series(val9)
val10

sophia    450
Mia       303
Philip    432
Emma      150
Lily      293
Grace     112
dtype: int64

In [64]:
val10[val10>300]

sophia    450
Mia       303
Philip    432
dtype: int64

In [75]:
val10[val10>200]

sophia    450
Mia       303
Philip    432
Lily      293
dtype: int64

In [79]:
val10[(val10>200) & (val10<300)]

Lily    293
dtype: int64

In [83]:
# equally spaced array of values

In [95]:
class1=np.linspace(0,20,10)
class1

array([ 0.        ,  2.22222222,  4.44444444,  6.66666667,  8.88888889,
       11.11111111, 13.33333333, 15.55555556, 17.77777778, 20.        ])

In [94]:
class2=np.linspace(1,21,10)
class2

array([ 1.        ,  3.22222222,  5.44444444,  7.66666667,  9.88888889,
       12.11111111, 14.33333333, 16.55555556, 18.77777778, 21.        ])

In [96]:
class_series1=pd.Series(class1)
class_series2=pd.Series(class2)

In [ ]:
# adds to same and shows results

In [98]:
class_series1+class_series2

0     1.000000
1     5.444444
2     9.888889
3    14.333333
4    18.777778
5    23.222222
6    27.666667
7    32.111111
8    36.555556
9    41.000000
dtype: float64

In [99]:
pd.concat(class_series1,class_series1)

C:\Users\rakshapanwar\AppData\Local\Temp\ipykernel_16912\209071016.py:1: FutureWarning: In a future version of pandas all arguments of concat except for the argument 'objs' will be keyword-only.
  pd.concat(class_series1,class_series1)

TypeError: first argument must be an iterable of pandas objects, you passed an object of type "Series"

In [91]:
# appends or concats

In [102]:
class_series1.append(class_series1)

C:\Users\rakshapanwar\AppData\Local\Temp\ipykernel_16912\512287308.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  class_series1.append(class_series1)

0     0.000000
1     2.222222
2     4.444444
3     6.666667
4     8.888889
5    11.111111
6    13.333333
7    15.555556
8    17.777778
9    20.000000
0     0.000000
1     2.222222
2     4.444444
3     6.666667
4     8.888889
5    11.111111
6    13.333333
7    15.555556
8    17.777778
9    20.000000
dtype: float64

In [105]:
class_series1.append(class_series1,ignore_index=True)

C:\Users\rakshapanwar\AppData\Local\Temp\ipykernel_16912\1604360850.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  class_series1.append(class_series1,ignore_index=True)

0      0.000000
1      2.222222
2      4.444444
3      6.666667
4      8.888889
5     11.111111
6     13.333333
7     15.555556
8     17.777778
9     20.000000
10     0.000000
11     2.222222
12     4.444444
13     6.666667
14     8.888889
15    11.111111
16    13.333333
17    15.555556
18    17.777778
19    20.000000
dtype: float64

In [107]:
class_series1.append(class_series1,ignore_index=False)

C:\Users\rakshapanwar\AppData\Local\Temp\ipykernel_16912\1285703429.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  class_series1.append(class_series1,ignore_index=False)

0     0.000000
1     2.222222
2     4.444444
3     6.666667
4     8.888889
5    11.111111
6    13.333333
7    15.555556
8    17.777778
9    20.000000
0     0.000000
1     2.222222
2     4.444444
3     6.666667
4     8.888889
5    11.111111
6    13.333333
7    15.555556
8    17.777778
9    20.000000
dtype: float64

In [100]:
pd.concat([class_series1,class_series1])

0     0.000000
1     2.222222
2     4.444444
3     6.666667
4     8.888889
5    11.111111
6    13.333333
7    15.555556
8    17.777778
9    20.000000
0     0.000000
1     2.222222
2     4.444444
3     6.666667
4     8.888889
5    11.111111
6    13.333333
7    15.555556
8    17.777778
9    20.000000
dtype: float64

In [113]:
pd.concat([class_series1,class_series1],ignore_index=True)

0      0.000000
1      2.222222
2      4.444444
3      6.666667
4      8.888889
5     11.111111
6     13.333333
7     15.555556
8     17.777778
9     20.000000
10     0.000000
11     2.222222
12     4.444444
13     6.666667
14     8.888889
15    11.111111
16    13.333333
17    15.555556
18    17.777778
19    20.000000
dtype: float64

In [101]:
pd.concat([class_series1,class_series1],keys=["Even","Odd"],names=["category","index"])

category  index
Even      0         0.000000
          1         2.222222
          2         4.444444
          3         6.666667
          4         8.888889
          5        11.111111
          6        13.333333
          7        15.555556
          8        17.777778
          9        20.000000
Odd       0         0.000000
          1         2.222222
          2         4.444444
          3         6.666667
          4         8.888889
          5        11.111111
          6        13.333333
          7        15.555556
          8        17.777778
          9        20.000000
dtype: float64

In [112]:
pd.concat([class_series1,class_series1],keys=["Even","Odd"],names=["category","index"],ignore_index=True)

0      0.000000
1      2.222222
2      4.444444
3      6.666667
4      8.888889
5     11.111111
6     13.333333
7     15.555556
8     17.777778
9     20.000000
10     0.000000
11     2.222222
12     4.444444
13     6.666667
14     8.888889
15    11.111111
16    13.333333
17    15.555556
18    17.777778
19    20.000000
dtype: float64

# Dataframes

In [116]:
d2={"Month":["Jan","Jan","Jan","Jan","Jan","Feb","Feb","Feb","Feb","March"],
   "Store":['A','B','C','D','E','A','B','C','D','A'],
   "Sales":[30124,65214,24550,34645,29314,6500,2900,4600,31500,14000]}

In [122]:
df1=pd.DataFrame(d2)
df1

   Month Store  Sales
0    Jan     A  30124
1    Jan     B  65214
2    Jan     C  24550
3    Jan     D  34645
4    Jan     E  29314
5    Feb     A   6500
6    Feb     B   2900
7    Feb     C   4600
8    Feb     D  31500
9  March     A  14000

In [123]:
df1.head()

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
2   Jan     C  24550
3   Jan     D  34645
4   Jan     E  29314

In [124]:
df1.tail()

   Month Store  Sales
5    Feb     A   6500
6    Feb     B   2900
7    Feb     C   4600
8    Feb     D  31500
9  March     A  14000

In [126]:
df1.sample(3)

   Month Store  Sales
9  March     A  14000
4    Jan     E  29314
8    Feb     D  31500

In [131]:
df1.shape

(10, 3)

In [129]:
df1.dtypes

Month    object
Store    object
Sales     int64
dtype: object

In [130]:
df1.info

<bound method DataFrame.info of    Month Store  Sales
0    Jan     A  30124
1    Jan     B  65214
2    Jan     C  24550
3    Jan     D  34645
4    Jan     E  29314
5    Feb     A   6500
6    Feb     B   2900
7    Feb     C   4600
8    Feb     D  31500
9  March     A  14000>

# iloc -> retrieve row and column using index
# retrieve using row names and column name

In [133]:
df1.iloc[1]

Month      Jan
Store        B
Sales    65214
Name: 1, dtype: object

In [137]:
df1.iloc[0]['Store']

'A'

In [138]:
df1.iloc[3:6]

  Month Store  Sales
3   Jan     D  34645
4   Jan     E  29314
5   Feb     A   6500

In [139]:
df1.iloc[::2]

  Month Store  Sales
0   Jan     A  30124
2   Jan     C  24550
4   Jan     E  29314
6   Feb     B   2900
8   Feb     D  31500

In [143]:
df1.iloc[::]['Sales']

0    30124
1    65214
2    24550
3    34645
4    29314
5     6500
6     2900
7     4600
8    31500
9    14000
Name: Sales, dtype: int64

In [145]:
df1.iloc[::][['Sales','Store']]

   Sales Store
0  30124     A
1  65214     B
2  24550     C
3  34645     D
4  29314     E
5   6500     A
6   2900     B
7   4600     C
8  31500     D
9  14000     A

In [146]:
df1.iloc[:,:2]

   Month Store
0    Jan     A
1    Jan     B
2    Jan     C
3    Jan     D
4    Jan     E
5    Feb     A
6    Feb     B
7    Feb     C
8    Feb     D
9  March     A

In [147]:
df1.iloc[:,::2]

   Month  Sales
0    Jan  30124
1    Jan  65214
2    Jan  24550
3    Jan  34645
4    Jan  29314
5    Feb   6500
6    Feb   2900
7    Feb   4600
8    Feb  31500
9  March  14000

In [149]:
df1.iloc[:,[0,2]]

   Month  Sales
0    Jan  30124
1    Jan  65214
2    Jan  24550
3    Jan  34645
4    Jan  29314
5    Feb   6500
6    Feb   2900
7    Feb   4600
8    Feb  31500
9  March  14000

In [150]:
df1.iloc[:,2][1]

65214

In [151]:
df1.loc[:,'Sales'][1]

65214

In [153]:
df1.loc[1]['Sales']

65214

In [163]:
df1.loc[:3][['Store','Sales']]

  Store  Sales
0     A  30124
1     B  65214
2     C  24550
3     D  34645

In [169]:
df1[df1.Sales>30000]

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
3   Jan     D  34645
8   Feb     D  31500

In [174]:
df1[(df1.Sales>30000) & (df1.Month=='Jan')]

  Month Store  Sales
0   Jan     A  30124
1   Jan     B  65214
3   Jan     D  34645

In [175]:
## create que and solution

In [178]:
df1[(df1.Sales<4000) & (df1.Month!='Jan') ]

  Month Store  Sales
6   Feb     B   2900

In [180]:
df1.sort_values('Sales')

   Month Store  Sales
6    Feb     B   2900
7    Feb     C   4600
5    Feb     A   6500
9  March     A  14000
2    Jan     C  24550
4    Jan     E  29314
0    Jan     A  30124
8    Feb     D  31500
3    Jan     D  34645
1    Jan     B  65214

In [183]:
df1.sort_values('Sales',ascending=False)

   Month Store  Sales
1    Jan     B  65214
3    Jan     D  34645
8    Feb     D  31500
0    Jan     A  30124
4    Jan     E  29314
2    Jan     C  24550
9  March     A  14000
5    Feb     A   6500
7    Feb     C   4600
6    Feb     B   2900

In [ ]:
df2=pd.read_csv('')